[
    {
        "id": 2,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie2.jpg",
        "tresc": "Fragment kodu napisany w języku HTML zamieszczony w ramce przedstawia listę"
    },
    {
        "id": 3,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie3.jpg",
        "tresc": "Fragment kodu prezentuje składnię języka"
    },
    {
        "id": 4,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który z zapisów znacznika <meta> jest prawidłowy ze względu na wykorzystane atrybuty?"
    },
    {
        "id": 5,
        "id_dzial": 1,
        "image": "",
        "tresc": "Znacznik <i> języka HTML służy do"
    },
    {
        "id": 6,
        "id_dzial": 1,
        "image": "",
        "tresc": "W językach programowania zmienna typu integer służy do przechowywania"
    },
    {
        "id": 7,
        "id_dzial": 1,
        "image": "",
        "tresc": "Która z operacji NIE WPŁYNIE na rozmiar / wielkość zajmowanej pamięci pliku graficznego?"
    },
    {
        "id": 8,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wskaż polecenie SQL dodające pole miesiacSiewu do istniejącej tabeli rosliny"
    },
    {
        "id": 9,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby skorzystać ze skryptu zapisanego w pliku przyklad.js, należy połączyć go ze stroną za pomocą kodu"
    },
    {
        "id": 10,
        "id_dzial": 1,
        "image": "",
        "tresc": "Automatyczna weryfikacja właściciela strony udostępnianej przez protokół HTTPS jest możliwa dzięki"
    },
    {
        "id": 11,
        "id_dzial": 1,
        "image": "",
        "tresc": "Jakiego rodzaju mechanizm kontroli bezpieczeństwa wykonywania aplikacji zawiera środowisko uruchomieniowe platformy .NET Framework?"
    },
    {
        "id": 12,
        "id_dzial": 1,
        "image": "",
        "tresc": "Za pomocą polecenia ALTER TABLE można"
    },
    {
        "id": 13,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie13.jpg",
        "tresc": "W załączonym fragmencie kodu CSS kolor jest zapisany w postaci"
    },
    {
        "id": 14,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie14.jpg",
        "tresc": "Podany styl tworzy obramowanie pojedyncze, o następujących cechach:"
    },
    {
        "id": 15,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie15.jpg",
        "tresc": "Ile iteracji będzie miała przedstawiona pętla zapisana w języku PHP, zakładając, że zmienna sterująca nie jest modyfikowana we wnętrzu pętli?"
    },
    {
        "id": 16,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie16.jpg",
        "tresc": "Wskaż stwierdzenie, które nie jest prawdziwe dla następującej definicji funkcji w języku C++?"
    },
    {
        "id": 17,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie17.jpg",
        "tresc": "Co definiuje w języku C++ przedstawiony fragment kodu?"
    },
    {
        "id": 18,
        "id_dzial": 1,
        "image": "",
        "tresc": "Jak nazywa się program, który wykonuje instrukcje zawarte w kodzie źródłowym tworzonego programu bez uprzedniego generowania programu wynikowego?"
    },
    {
        "id": 19,
        "id_dzial": 1,
        "image": "",
        "tresc": "Organizacja zajmująca się ustalaniem standardu dla języka HTML nosi nazwę"
    },
    {
        "id": 20,
        "id_dzial": 1,
        "image": "",
        "tresc": "Zadaniem funkcji PHP o nazwie mysql_select_db() jest"
    },
    {
        "id": 21,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wskaż BŁĘDNY opis optymalizacji kodu wynikowego programu"
    },
    {
        "id": 22,
        "id_dzial": 1,
        "image": "",
        "tresc": "W celu określenia wysokości obrazka wyświetlonego na stronie WWW należy wykorzystać właściwość CSS o nazwie"
    },
    {
        "id": 23,
        "id_dzial": 1,
        "image": "",
        "tresc": "Przy użyciu jakiego znacznika HTML otrzymamy tekst napisany czcionką o stałej szerokości znaku, który uwzględnia dodatkowe spacje, tabulacje i znaki końca linii?"
    },
    {
        "id": 24,
        "id_dzial": 1,
        "image": "",
        "tresc": "Formularz nadrzędny wykorzystywany do nawigacji w bazie danych pomiędzy dostępnymi w systemie formularzami, kwerendami jest nazywany formularzem"
    },
    {
        "id": 25,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie25.jpg",
        "tresc": "W jaki sposób wykonanie podanej w ramce kwerendy SQL wpłynie na tabelę pracownicy?"
    },
    {
        "id": 26,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby aplikacja PHP mogła komunikować się z bazą danych, niezbędne jest w pierwszej kolejności wywołanie funkcji o nazwie"
    },
    {
        "id": 27,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie27.jpg",
        "tresc": "Przedstawiony kod PHP nawiązuje połączenie z serwerem bazy danych. Jakiego typu operacje powinny się znaleźć w instrukcji warunkowej w miejscu trzech kropek?"
    },
    {
        "id": 28,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie28.jpg",
        "tresc": "W języku CSS poniższy zapis użyty na stronie, na której jest kilka paragrafów, a każdy z nich ma po kilka linii sprawi, że"
    },
    {
        "id": 29,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wskaż PRAWDZIWE stwierdzenie dla polecenia: CREATE TABLE IF NOT EXISTS ADRES(ulica VARCHAR(70) CHARACTER SET utf8);"
    },
    {
        "id": 30,
        "id_dzial": 1,
        "image": "",
        "tresc": "Za pomocą polecenia BACKUP LOG w MS SQL Server można"
    },
    {
        "id": 31,
        "id_dzial": 1,
        "image": "",
        "tresc": "Które ze stwierdzeń dotyczących klucza podstawowego jest prawdziwe?"
    },
    {
        "id": 32,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie32.jpg",
        "tresc": "Fragment kodu w języku PHP wypisze"
    },
    {
        "id": 33,
        "id_dzial": 1,
        "image": "",
        "tresc": "W bazie danych zdefiniowano tabelę Mieszkancy wypełnioną danymi. Aby usunąć tę tabelę wraz z zawartością, należy posłużyć się poleceniem"
    },
    {
        "id": 34,
        "id_dzial": 1,
        "image": "",
        "tresc": "Zdefiniowano bazę danych z tabelą podzespoły o polach: model, producent, typ, cena. Aby wyświetlić wszystkie modele pamięci RAM firmy Kingston w kolejności od najtańszej do najdroższej, należy posłużyć się kwerendą:"
    },
    {
        "id": 35,
        "id_dzial": 1,
        "image": "",
        "tresc": "Kod strony WWW napisanej w języku PHP"
    },
    {
        "id": 36,
        "id_dzial": 1,
        "image": "",
        "tresc": "Polecenie SQL, które usuwa bazę danych o nazwie firma, ma postać"
    },
    {
        "id": 37,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie37.jpg",
        "tresc": "Które ze stwierdzeń, w odniesieniu do zamieszczonej w ramce definicji funkcji, jest poprawne?"
    },
    {
        "id": 38,
        "id_dzial": 1,
        "image": "",
        "tresc": "Instrukcja DROP języka SQL ma za zadanie"
    },
    {
        "id": 39,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie39.jpg",
        "tresc": "Metainformacja \"Description\" zawarta w pliku źródłowym HTML powinna zawierać"
    },
    {
        "id": 40,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wskaż model barw, który stosuje się do wyświetlania kolorów na ekranie monitora komputerowego"
    },
    {
        "id": 41,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wskaż prawidłową kolejność tworzenia aplikacji"
    },
    {
        "id": 42,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie42.jpg",
        "tresc": "W języku CSS zdefiniowano następujące formatowanie. Oznacza to, że kolorem niebieskim zostanie zapisany"
    },
    {
        "id": 43,
        "id_dzial": 1,
        "image": "",
        "tresc": "Strona HTML definiuje akapit oraz rysunek. Aby rysunek został umieszczony przez przeglądarkę w tej samej linii co akapit po jego lewej stronie, należy w stylu CSS rysunku zawrzeć własność"
    },
    {
        "id": 44,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wartość i typ zmiennej w języku PHP można sprawdzić za pomocą funkcji"
    },
    {
        "id": 45,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku CSS wartości underline, overline, blink przyjmują atrybut"
    },
    {
        "id": 46,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie46.jpg",
        "tresc": "Instrukcja języka PHP tworząca obiekt pkt dla zdefiniowanej w ramce klasy Punkt ma postać"
    },
    {
        "id": 47,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku PHP sumę logiczną oznacza operator"
    },
    {
        "id": 48,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie48.jpg",
        "tresc": "Wskaż sposób, w jaki należy odwołać się do pliku default.css, jeśli index.html znajduje się bezpośrednio w katalogu Strona?"
    },
    {
        "id": 49,
        "id_dzial": 1,
        "image": "",
        "tresc": "Jakie należy posiadać uprawnienia, aby wykonać i odtworzyć kopię zapasową bazy danych Microsoft SQL Server 2005 Express?"
    },
    {
        "id": 50,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie50.jpg",
        "tresc": "Który modyfikator wskazuje podany opis?"
    },
    {
        "id": 51,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku CSS wcięcie pierwszej linii akapitu na 30 pikseli uzyska się za pomocą zapisu"
    },
    {
        "id": 52,
        "id_dzial": 1,
        "image": "",
        "tresc": "Jednoznacznym identyfikatorem rekordu w bazie danych jest pole"
    },
    {
        "id": 53,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie53.jpg",
        "tresc": "Aby wyświetlić jedynie imię, nazwisko i ulicę wszystkich mieszkańców, należy zastosować zapytanie"
    },
    {
        "id": 54,
        "id_dzial": 1,
        "image": "",
        "tresc": "Uprawnienia obiektowe, nadawane użytkownikom serwera bazy danych, mogą pozwalać lub zabraniać"
    },
    {
        "id": 55,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który z wymienionych formatów plików graficznych obsługuje przezroczystość?"
    },
    {
        "id": 56,
        "id_dzial": 1,
        "image": "",
        "tresc": "W celu dodania rekordu do tabeli Pracownicy należy użyć polecenia SQL"
    },
    {
        "id": 57,
        "id_dzial": 1,
        "image": "",
        "tresc": "Grafik wykonał logo strony internetowej. To czarny znaczek na przezroczystym tle. Aby zachować wszystkie atrybuty obrazu i umieścić go na stronie internetowej, grafik powinien zapisać obraz w formacie"
    },
    {
        "id": 58,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie58.jpg",
        "tresc": "Wynikiem uruchomienia zapytania SQL jest"
    },
    {
        "id": 59,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie59.jpg",
        "tresc": "W zamieszczonym przykładzie pseudoklasa hover sprawi, że styl pogrubiony będzie przypisany"
    },
    {
        "id": 60,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby w tworzonej w języku SQL tabeli praca dodać w kolumnie stawka warunek, że musi przyjmować rzeczywiste wartości dodatnie mniejsze od 50, należy użyć zapisu"
    },
    {
        "id": 61,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku PHP, wykonując operacje na bazie danych MySQL, aby zakończyć pracę z bazą, należy wywołać"
    },
    {
        "id": 62,
        "id_dzial": 1,
        "image": "",
        "tresc": "Najprostszą i najmniej pracochłonną metodą przetestowania działania witryny internetowej w wielu przeglądarkach i ich różnych wersjach jest"
    },
    {
        "id": 63,
        "id_dzial": 1,
        "image": "",
        "tresc": "Pętla while powinna być wykonywana tak długo, jak długo zmienna x będzie przyjmowała wartości z przedziału obustronnie otwartego (-2, 5). Zapis tego warunku w nagłówku pętli za pomocą języka PHP ma postać"
    },
    {
        "id": 64,
        "id_dzial": 1,
        "image": "",
        "tresc": "Oznaczenie barwy w postaci #ff00e0 jest równoważne zapisowi"
    },
    {
        "id": 65,
        "id_dzial": 1,
        "image": "",
        "tresc": "Blok deklaracji postaci background-attachment: scroll powoduje, że"
    },
    {
        "id": 66,
        "id_dzial": 1,
        "image": "",
        "tresc": "Parametr face znacznika <font> służy do określenia"
    },
    {
        "id": 67,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który fragment kodu JavaScript zwróci wartość true?"
    },
    {
        "id": 68,
        "id_dzial": 1,
        "image": "",
        "tresc": "Podczas obróbki grafiki rastrowej w programie z obsługą kanałów dodanie kanału alfa oznacza"
    },
    {
        "id": 69,
        "id_dzial": 1,
        "image": "",
        "tresc": "Baza danych zawiera tabelę o nazwie pracownicy o polach: nazwisko, imie, pensja, wiek. Jak wygląda składnia polecenia wyznaczającego średnią pensję pracowników?"
    },
    {
        "id": 70,
        "id_dzial": 1,
        "image": "",
        "tresc": "Typ zmiennej w języku JavaScript"
    },
    {
        "id": 71,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby utworzyć relację jeden do wielu, w tabeli po stronie wiele, należy zdefiniować"
    },
    {
        "id": 72,
        "id_dzial": 1,
        "image": "",
        "tresc": "Liczba 0x142, zapisana w kodzie skryptu JavaScript, ma postać"
    },
    {
        "id": 73,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie73.jpg",
        "tresc": "Wciśnięcie przycisku o treści \"niebieski\" spowoduje wykonanie przedstawionego kodu JavaScript. Jaki będzie efekt jego działania?"
    },
    {
        "id": 74,
        "id_dzial": 1,
        "image": "",
        "tresc": "Kod języka CSS można umieścić wewnątrz kodu HTML, posługując się znacznikiem"
    },
    {
        "id": 75,
        "id_dzial": 1,
        "image": "",
        "tresc": "Polecenie w języku SQL ALTER TABLE USA... ma za zadanie"
    },
    {
        "id": 76,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie76.jpg",
        "tresc": "Jaki rezultat zostanie wyświetlony po wykonaniu przedstawionego kodu HTML?"
    },
    {
        "id": 77,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby przywrócić bazę danych MS SQL z kopii bezpieczeństwa, należy zastosować polecenie"
    },
    {
        "id": 78,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie78.jpg",
        "tresc": "Do tabeli pracownicy wpisano rekordy. Co zostanie wyświetlone po uruchomieniu kwerendy SQL SELECT podanej w ramce?"
    },
    {
        "id": 79,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku MySQL należy zastosować polecenie REVOKE, aby użytkownikowi anna odebrać prawo do dokonywania zmian jedynie w definicji struktury bazy danych. Polecenie odpowiadające odebraniu tych praw ma postać"
    },
    {
        "id": 80,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie80.jpg",
        "tresc": "Ile iteracji będzie miała pętla zapisana w języku PHP, zakładając, że zmienna sterująca nie jest modyfikowana we wnętrzu pętli?"
    },
    {
        "id": 81,
        "id_dzial": 1,
        "image": "",
        "tresc": "Modelem barw opisującym kolor z użyciem stożka przestrzeni barw jest"
    },
    {
        "id": 82,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie82.jpg",
        "tresc": "Podane polecenie SQL nadaje prawo SELECT"
    },
    {
        "id": 83,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie83.jpg",
        "tresc": "W języku CSS, zapis w następującej postaci sprawi, iż koloru czerwonego będzie"
    },
    {
        "id": 84,
        "id_dzial": 1,
        "image": "",
        "tresc": "Funkcja JavaScript powinna być wywołana za każdym razem, gdy użytkownik wpisze dowolny znak do pola edycji. Którego zdarzenia należy użyć?"
    },
    {
        "id": 85,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie85.jpg",
        "tresc": "Przedstawiona w języku CSS definicja stylu dotyczy odsyłacza, który"
    },
    {
        "id": 86,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku HTML aby zdefiniować poziomą linię, należy użyć znacznika"
    },
    {
        "id": 87,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie87.jpg",
        "tresc": "Po wykonaniu przedstawionego kodu JavaScript wyświetli się wartość"
    },
    {
        "id": 88,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie88.jpg",
        "tresc": "Przedstawiona w języku C++ definicja typu wyliczeniowego sprawi, że enumerator CZWARTEK będzie równy"
    },
    {
        "id": 89,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie89.jpg",
        "tresc": "Instrukcja przypisania elementu do tablicy w języku JavaScript dotyczy tablicy"
    },
    {
        "id": 90,
        "id_dzial": 1,
        "image": "",
        "tresc": "Programem do edycji dźwięku jest"
    },
    {
        "id": 91,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie91.jpg",
        "tresc": "Którą relację w projekcie bazy danych należy ustalić między tabelami widocznymi na rysunku zakładając, że każdy klient sklepu internetowego dokona przynajmniej dwóch zamówień?"
    },
    {
        "id": 92,
        "id_dzial": 1,
        "image": "",
        "tresc": "W relacyjnym modelu baz danych krotkami nazywa się"
    },
    {
        "id": 93,
        "id_dzial": 1,
        "image": "",
        "tresc": "Formularze do obsługi baz danych tworzy się w celu"
    },
    {
        "id": 94,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie94.jpg",
        "tresc": "W języku CSS zdefiniowano następujące formatowanie. Kolorem czerwonym zostanie zapisany"
    },
    {
        "id": 95,
        "id_dzial": 1,
        "image": "",
        "tresc": "Zadaniem funkcji PHP o nazwie mysql_num_rows() jest"
    },
    {
        "id": 96,
        "id_dzial": 1,
        "image": "",
        "tresc": "Baza danych księgarni zawiera tabelę ksiazki z polami: id, idAutor, tytul, ileSprzedanych oraz tabelę autorzy z polami: id, imie, nazwisko. Aby stworzyć raport sprzedanych książek z tytułami i nazwiskami autorów, należy"
    },
    {
        "id": 97,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby zdefiniować w języku HTML listę nienumerowaną, należy użyć znacznika"
    },
    {
        "id": 98,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie98.jpg",
        "tresc": "Przedstawiono fragment kodu HTML, który nie waliduje się poprawnie. Błąd walidacji tego fragmentu kodu będzie dotyczył"
    },
    {
        "id": 99,
        "id_dzial": 1,
        "image": "",
        "tresc": "Komentarz w kodzie PHP można umieścić pomiędzy znakami"
    },
    {
        "id": 100,
        "id_dzial": 1,
        "image": "",
        "tresc": "Kolor zapisany kodem RGB, o wartości rgb(255, 128, 16) w kodzie szesnastkowym będzie miał wartość:"
    },
    {
        "id": 101,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie101.jpg",
        "tresc": "W formularzu dane z pola input o typie number zostały zapisane do zmiennej a, a następnie przetworzone w skrypcie JavaScript w następujący sposób. Zmienna z będzie typu"
    },
    {
        "id": 102,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku skryptowym JavaScript zmienne mogą być deklarowane"
    },
    {
        "id": 103,
        "id_dzial": 1,
        "image": "",
        "tresc": "Znacznik <s> w języku HTML powoduje"
    },
    {
        "id": 104,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie104.jpg",
        "tresc": "W języku CSS określono formatowanie znacznika h1 według wzoru. Zakładając, że żadne inne formatowanie nie jest dodane do znacznika h1, wskaż sposób formatowania tego znacznika"
    },
    {
        "id": 105,
        "id_dzial": 1,
        "image": "",
        "tresc": "W instrukcji warunkowej języka JavaScript należy sprawdzić przypadek, gdy wartość zmiennej a jest z przedziału (0, 100), natomiast wartość zmiennej b jest większa od zera. Warunek taki jest prawidłowo zapisany w nastepujący sposób"
    },
    {
        "id": 106,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wbudowanym w pakiet XAMPP narzędziem służącym do zarządzania bazą danych jest"
    },
    {
        "id": 107,
        "id_dzial": 1,
        "image": "",
        "tresc": "Błędy interpretacji kodu PHP są zapisane:"
    },
    {
        "id": 108,
        "id_dzial": 1,
        "image": "",
        "tresc": "Jakiego znacznika należy użyć, aby przejść do kolejnej linii tekstu, nie tworząc akapitu na stronie interenetowej ?"
    },
    {
        "id": 109,
        "id_dzial": 1,
        "image": "",
        "tresc": "Jeśli rozmiar pliku graficznego jest zbyt duży do publikacji w Internecie, należy"
    },
    {
        "id": 110,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku SQL aby zmodyfikować dane w tabeli, należy posłużyć się poleceniem"
    },
    {
        "id": 111,
        "id_dzial": 1,
        "image": "",
        "tresc": "W poleceniach, których celem jest odtwarzanie na stronie internetowej dźwięku jako podkładu muzycznego NIE wykorzystuje się atrybutu"
    },
    {
        "id": 112,
        "id_dzial": 1,
        "image": "",
        "tresc": "Jak nazywa się element bazy danych, za pomocą którego można jedynie odczytać dane z bazy, prezentując je w postaci tekstu lub wykresu?"
    },
    {
        "id": 113,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie113.jpg",
        "tresc": "W przedstawionej definicji stylu CSS, powtarzanie dotyczy"
    },
    {
        "id": 114,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie114.jpg",
        "tresc": "Najprostszy sposób zamiany obiektu oznaczonego cyfrą 1 na obiekt oznaczony cyfrą 2 polega na"
    },
    {
        "id": 115,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie115.jpg",
        "tresc": "Poprawne udokumentowanie wzorca weryfikacji pola nazwa w części kodu aplikacji JavaScript to"
    },
    {
        "id": 116,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który styl CSS pozwoli zdefiniować wyrównanie tekstu do prawej strony?"
    },
    {
        "id": 117,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie117.jpg",
        "tresc": "Po wykonaniu się przedstawionego fragmentu kodu języka C/C++ zmiennej o nazwie zmienna2 zostanie"
    },
    {
        "id": 118,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby wykonać kod zapisany językiem PHP wystarczy, że w systemie zainstalowano"
    },
    {
        "id": 119,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku HTML aby zdefiniować słowa kluczowe strony, należy użyć zapisu"
    },
    {
        "id": 120,
        "id_dzial": 1,
        "image": "",
        "tresc": "Hermetyzacja to zasada programowania obiektowego mówiąca o tym, że"
    },
    {
        "id": 121,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie121.jpg",
        "tresc": "W przedstawionym kodzie PHP, zamiast znaków zapytania powinien pojawić się komunikat:"
    },
    {
        "id": 122,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie122.jpg",
        "tresc": "Przedstawione polecenie SQL, użytkownikowi adam@localhost nadaje prawa"
    },
    {
        "id": 123,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku PHP instrukcja foreach jest instrukcją"
    },
    {
        "id": 124,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie124.jpg",
        "tresc": "Warunek zapisany w JavaScript jest prawdziwy, gdy zmienna x przechowuje"
    },
    {
        "id": 125,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie125.jpg",
        "tresc": "Przedstawione pole input umożliwi"
    },
    {
        "id": 126,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie126.jpg",
        "tresc": "Za pomocą przedstawionego zapytania w tabeli zostanie"
    },
    {
        "id": 127,
        "id_dzial": 1,
        "image": "",
        "tresc": "Kanał alfa służy do zdefiniowania"
    },
    {
        "id": 128,
        "id_dzial": 1,
        "image": "",
        "tresc": "Znacznik języka HTML, który służy do oznaczenia fragmentu tekstu jako kodu komputerowego, to"
    },
    {
        "id": 129,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku zapytań SQL, aby dodać do tabeli Towar kolumnę rozmiar typu znakowego o maksymalnej długości 20 znaków, należy wykonać polecenie"
    },
    {
        "id": 130,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie130.jpg",
        "tresc": "W języku HTML zdefiniowano hiperłącze ze znakiem #. Co stanie się po wybraniu przedstawionego odsyłacza?"
    },
    {
        "id": 131,
        "id_dzial": 1,
        "image": "",
        "tresc": "W tabeli personel znajdują się pola: imie, nazwisko, pensja, staz. Aby otrzymać średnią pensję pracowników, dla których staż wynosi od 10 do 20 lat pracy włącznie, należy wykonać kwerendę:"
    },
    {
        "id": 132,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku HTML, aby scalić w pionie dwie sąsiednie komórki w kolumnie tabeli, należy zastosować atrybut"
    },
    {
        "id": 133,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku HTML dla hiperłącza wartość atrybutu target, która odpowiada za załadowanie strony do nowego okna lub karty, to"
    },
    {
        "id": 134,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie134.jpg",
        "tresc": "Wskaż typ relacji pomiędzy tabelami: Tabela1 i Tabela3"
    },
    {
        "id": 135,
        "id_dzial": 1,
        "image": "",
        "tresc": "W skrypcie JavaScript zastosowano metodę DOM getElementsByClassName('akapit'). Metoda ta odwoła się do akapitu"
    },
    {
        "id": 136,
        "id_dzial": 1,
        "image": "",
        "tresc": "Dana jest tabela o nazwie wycieczki z polami: nazwa, cena, miejsca (jako liczba wolnych miejsc). Aby dla dowolnego zbioru danych tabeli wyświetlić jedynie nazwy tych wycieczek, dla których cena jest niższa niż 2000 zł i mają przynajmniej cztery wolne miejsca, należy posłużyć się zapytaniem"
    },
    {
        "id": 137,
        "id_dzial": 1,
        "image": "",
        "tresc": "Polecenie REVOKE SELECT ON nazwa1 FROM nazwa2 w języku SQL umożliwia"
    },
    {
        "id": 138,
        "id_dzial": 1,
        "image": "",
        "tresc": "W algebrze relacji operacja selekcji polega na"
    },
    {
        "id": 139,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie139.jpg",
        "tresc": "Które tabele zostaną sprawdzone za pomocą przedstawionego polecenia?"
    },
    {
        "id": 140,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie140.jpg",
        "tresc": "W języku HTML zdefiniowano listę, która"
    },
    {
        "id": 141,
        "id_dzial": 1,
        "image": "",
        "tresc": "Znacznik <ins> w języku HTML służy do oznaczenia"
    },
    {
        "id": 142,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie142.jpg",
        "tresc": "Jakie uprawnienia będzie miał użytkownik jan po wykonaniu na bazie danych przedstawionych poleceń?"
    },
    {
        "id": 143,
        "id_dzial": 1,
        "image": "",
        "tresc": "Edytując grafikę w edytorze grafiki rastrowej należy pozbyć się kolorów z rysunku tak, aby obraz był w odcieniach szarości. Można do tego efektu wykorzystać funkcję"
    },
    {
        "id": 144,
        "id_dzial": 1,
        "image": "",
        "tresc": "Kaskadowe arkusze stylów tworzy się w celu"
    },
    {
        "id": 145,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie145.jpg",
        "tresc": "Który z komentarzy opisuje zadanie zdefiniowanej w języku PHP funkcji?"
    },
    {
        "id": 146,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie146.jpg",
        "tresc": "Na rysunku przedstawiono dwie tabele. Aby połączyć je relacją jeden do wielu, jeden po stronie Klienci wiele po stronie Zamowienia, należy"
    },
    {
        "id": 147,
        "id_dzial": 1,
        "image": "",
        "tresc": "W bazie danych MYSQL dana jest tabela programów komputerowych o polach: nazwa, producent, rokWydania. Aby kwerenda SELECT zwróciła wszystkie nazwy producentów tak, by nazwy te nie powtarzały się, należy zapisać:"
    },
    {
        "id": 148,
        "id_dzial": 1,
        "image": "",
        "tresc": "Znaczniki <header>, <article>, <section>, <footer> są charakterystyczne dla języka"
    },
    {
        "id": 149,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie149.jpg",
        "tresc": "Na podstawie tabeli Towar wykonano następujące zapytanie SQL. Jaki będzie wynik tej operacji?"
    },
    {
        "id": 150,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku CSS aby zdefiniować odmienne formatowanie dla pierwszej litery akapitu, należy zastosować selektor"
    },
    {
        "id": 151,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie151.jpg",
        "tresc": "W języku PHP zapisano fragment kodu. Po zakończeniu pętli zmienna a przyjmie wartość"
    },
    {
        "id": 152,
        "id_dzial": 1,
        "image": "",
        "tresc": "Zapisując hasło użytkownika serwisu WWW (np. bankowości internetowej), w celu jego zabezpieczenia przed odtajnieniem, zwykle używa się funkcji"
    },
    {
        "id": 153,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie153.jpg",
        "tresc": "W przedstawonym kodzie JavaScript dla ułatwienia ponumerowano linie. W kodzie znajduje się błąd, gdyż po uruchomieniu żaden komunikat nie zostaje wyświetlony. Aby wyeliminować błąd, należy"
    },
    {
        "id": 154,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który ze sposobów wypisania tekstu nie jest zdefiniowany w języku JavaScript?"
    },
    {
        "id": 155,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie155.jpg",
        "tresc": "Przedstawiona instrukcja JavaScript wyświetli"
    },
    {
        "id": 156,
        "id_dzial": 1,
        "image": "",
        "tresc": "Przed wykonaniem kopii bezpieczeństwa bazy danych, tak aby kopia ta była poprawna i możliwa do późniejszego odtworzenia, należy sprawdzić"
    },
    {
        "id": 157,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wskaż poprawny zapis instrukcji zapisanej w języku JavaScript."
    },
    {
        "id": 158,
        "id_dzial": 1,
        "image": "",
        "tresc": "Funkcja drzewo kontekstowe edytor WYSIWYG Adobe Dreamweaver służy do"
    },
    {
        "id": 159,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie159.jpg",
        "tresc": "Która lista jest interpretacją przedstawionego kodu?"
    },
    {
        "id": 160,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku PHP zmienna typu float przyjmuje wartości"
    },
    {
        "id": 161,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie161.jpg",
        "tresc": "W części nagłówkowej kodu HTML zapisano tekst przedstawiony na obrazku. Zapisany tekst zostanie wyświetlony"
    },
    {
        "id": 162,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku SQL klauzula DISTINCT instrukcji SELECT sprawi, że zwrócone dane"
    },
    {
        "id": 163,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie163.jpg",
        "tresc": "Po wykonaniu zamieszczonego w ramce skryptu napisanego w języku JavaScript w przeglądarce zostanie wypisana wartość"
    },
    {
        "id": 164,
        "id_dzial": 1,
        "image": "",
        "tresc": "W skrypcie PHP należy utworzyć cookie o nazwie owoce które przyjmie wartość jabłko. Cookie ma być dostępne przez jedną godzinę od jego utworzenia. W tym celu należy w skrypcie PHP użyć funkcji:"
    },
    {
        "id": 165,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wskaż dwa sposoby zabezpieczenia bazy danych Microsoft Access"
    },
    {
        "id": 166,
        "id_dzial": 1,
        "image": "",
        "tresc": "Zdarzenie JavaScript, będące reakcją na pojedynczo kliknięty dowolny element strony, nosi nazwę"
    },
    {
        "id": 167,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie167.jpg",
        "tresc": "Na potrzeby strony internetowej zdefiniowano styl. Styl będzie przypisany tylko do niektórych znaczników (np. niektórych nagłówków, kilku akapitów). W takim wypadku, aby przypisać styl do kilku konkretnych znaczników, najlepiej jest zastosować"
    },
    {
        "id": 168,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie168.jpg",
        "tresc": "Przedstawiono efekt formatowania CSS oraz kod HTML. Jak należy zdefiniować styl, aby osiągnąć takie formatowanie?"
    },
    {
        "id": 169,
        "id_dzial": 1,
        "image": "",
        "tresc": "Dana jest tabela zwierzeta z polami: nazwa, gatunek, gromada, cechy, dlugosc_zycia. Dla dowolnego zestawu danych, aby wyświetlić nazwy tych zwierząt, które żyją przynajmniej 20 lat oraz są ssakami, należy wydać zapytanie:"
    },
    {
        "id": 170,
        "id_dzial": 1,
        "image": "",
        "tresc": "DOM dostarcza metod i własności, które w języku JavaScript pozwalają na"
    },
    {
        "id": 171,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby odebrać prawa dostępu do serwera MySQL, należy posłużyć się instrukcją"
    },
    {
        "id": 172,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie172.jpg",
        "tresc": "Które z pól są umieszczone w formularzu?"
    },
    {
        "id": 173,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku JavaScript metoda getElementById() odwołuje się do"
    },
    {
        "id": 174,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie174.jpg",
        "tresc": "Zamieszczony kod HTML formularza zostanie wyświetlony przez przeglądarkę w sposób:"
    },
    {
        "id": 175,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku PHP w instrukcji switch musi występować"
    },
    {
        "id": 176,
        "id_dzial": 1,
        "image": "",
        "tresc": "Językami programowania działającymi po stronie serwera są:"
    },
    {
        "id": 177,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie177.jpg",
        "tresc": "Wskaż rezultat działania fragmentu kodu JavaScript"
    },
    {
        "id": 178,
        "id_dzial": 1,
        "image": "",
        "tresc": "Chcąc zdefiniować marginesy wewnętrzne dla danych: margines górny 50px, dolny 40px, prawy 20px i lewy 30px należy użyć składni CSS"
    },
    {
        "id": 179,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie179.jpg",
        "tresc": "Które z formatowań NIE JEST wyrażone w języku CSS?"
    },
    {
        "id": 180,
        "id_dzial": 1,
        "image": "",
        "tresc": "Plik graficzny należy zapisać w formacie GIF, jeżeli"
    },
    {
        "id": 181,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie181.jpg",
        "tresc": "Przedstawiony blok reprezentuje czynność"
    },
    {
        "id": 182,
        "id_dzial": 1,
        "image": "",
        "tresc": "W serwerze MySQL nadanie roli o nazwie DBManager przyznaje użytkownikowi prawa umożliwiające"
    },
    {
        "id": 183,
        "id_dzial": 1,
        "image": "",
        "tresc": "Bitmapa jest obrazem"
    },
    {
        "id": 184,
        "id_dzial": 1,
        "image": "",
        "tresc": "Które ze stwierdzeń dotyczących języków programowania NIE jest prawdziwe"
    },
    {
        "id": 185,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie185.jpg",
        "tresc": "Wskaż wynik wykonania skryptu napisanego w języku PHP"
    },
    {
        "id": 186,
        "id_dzial": 1,
        "image": "",
        "tresc": "W czasie przetwarzania dźwięku, aby pozbyć się niechcianych odgłosów spowodowanych złą jakością mikrofonu, należy zastosować narzędzie"
    },
    {
        "id": 187,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie187.jpg",
        "tresc": "Tablica tab[] jest wypełniona dowolnymi liczbami całkowitymi. Jaka wartość znajdzie się w zmiennej zm2 po wykonaniu prezentowanego fragmentu kodu?"
    },
    {
        "id": 188,
        "id_dzial": 1,
        "image": "",
        "tresc": "Tworzenie i przypisanie do zmiennej tablicy asocjacyjnej zrealizuje się w PHP zapisem"
    },
    {
        "id": 189,
        "id_dzial": 1,
        "image": "",
        "tresc": "Saturacja koloru nazywana jest inaczej"
    },
    {
        "id": 190,
        "id_dzial": 1,
        "image": "",
        "tresc": "W kodzie PHP znak \"//\" oznacza"
    },
    {
        "id": 191,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku SQL polecenie INSERT INTO"
    },
    {
        "id": 192,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie192.jpg",
        "tresc": "W kodzie JavaScript pętla zostanie wykonana"
    },
    {
        "id": 193,
        "id_dzial": 1,
        "image": "",
        "tresc": "Model opisu przestrzeni barw o parametrach: odcień, nasycenie i jasność, to"
    },
    {
        "id": 194,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który znacznik należący do sekcji head dokumentu HTML w wersji 5 jest wymagany przez walidator języka HTML, a jego brak jest zgłaszany jako błąd (error)?"
    },
    {
        "id": 195,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie195.jpg",
        "tresc": "Której funkcji edytora grafiki rastrowej należy użyć, aby przygotować rysunek do wyświetlenia na stronie w ten sposób, żeby było widoczne tylko to, co znajduje się w ramce?"
    },
    {
        "id": 196,
        "id_dzial": 1,
        "image": "",
        "tresc": "Model barw oparty na 3 parametrach: odcień, nasycenie i jasność to"
    },
    {
        "id": 197,
        "id_dzial": 1,
        "image": "",
        "tresc": "Kodowanie w standardzie ISO-8859-2 stosowane jest w celu poprawnego wyświetlenia"
    },
    {
        "id": 198,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby naprawić uszkodzoną tabelę w MySQL, należy wydać polecenie"
    },
    {
        "id": 199,
        "id_dzial": 1,
        "image": "",
        "tresc": "Jaki program komputerowy przekształca kod źródłowy, napisany w konkretnym języku programowania, na język komputera?"
    },
    {
        "id": 200,
        "id_dzial": 1,
        "image": "",
        "tresc": "Kolor 255 12 12 w modelu RGB na stronie www powinien być zapisany w postaci"
    },
    {
        "id": 201,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie201.jpg",
        "tresc": "Przedstawiony fragment dokumentu HTML z kodem JavaScript spowoduje, że po wciśnięciu przycisku"
    },
    {
        "id": 202,
        "id_dzial": 1,
        "image": "",
        "tresc": "Które zapytanie SQL dla tabeli pracownicy utworzonej według schematu: id, imie, nazwisko, plec, zarobek, obliczy osobno średni zarobek kobiet i średni zarobek mężczyzn?"
    },
    {
        "id": 203,
        "id_dzial": 1,
        "image": "",
        "tresc": "Które polecenie wydane z konsoli systemowej dokona przywrócenia bazy danych?"
    },
    {
        "id": 204,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie204.jpg",
        "tresc": "W celu uzyskania efektu widocznego na rysunku, w kodzie HTML, należy umieścić znacznik skrótu <abbr> z atrybutem"
    },
    {
        "id": 205,
        "id_dzial": 1,
        "image": "",
        "tresc": "Relacja w bazach danych jest"
    },
    {
        "id": 206,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie206.jpg",
        "tresc": "Zapis CSS w takiej postaci sprawi, że na stronie internetowej"
    },
    {
        "id": 207,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie207.jpg",
        "tresc": "Poniżej została przedstawiona obsługa"
    },
    {
        "id": 208,
        "id_dzial": 1,
        "image": "",
        "tresc": "Transformację w stylach CSS, polegającą na zamianie tylko pierwszych liter wszystkich wyrazów na wielkie, otrzymamy stosując polecenie"
    },
    {
        "id": 209,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku HTML znacznik <strong>tekst</strong> będzie wyświetlany w ten sam sposób przez przeglądarkę co znacznik"
    },
    {
        "id": 210,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku SQL przywilej SELECT polecenia GRANT pozwala użytkownikowi baz danych na"
    },
    {
        "id": 211,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który parametr obiektu graficznego ulegnie zmianie po modyfikacji wartości kanału alfa?"
    },
    {
        "id": 212,
        "id_dzial": 1,
        "image": "",
        "tresc": "Które wyrażenie logiczne w języku PHP sprawdza, czy zmienna1 należy do przedziału jednostronnie domkniętego <-5, 10)?"
    },
    {
        "id": 213,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku HTML atrybut alt znacznika img jest wykorzystywany w celu zdefiniowania"
    },
    {
        "id": 214,
        "id_dzial": 1,
        "image": "",
        "tresc": "Baza danych 6-letniej szkoły podstawowej zawiera tabelę szkola z polami: imie, nazwisko, klasa. Wszyscy uczniowie klas 1-5 zdali do następnej klasy. Aby zwiększyć wartość w polu klasa o 1 należy użyć polecenia"
    },
    {
        "id": 215,
        "id_dzial": 1,
        "image": "",
        "tresc": "Deklaracja typu dokumentu HTML: <!DOCTYPE HTML> oznacza, że kod jest napisany w wersji"
    },
    {
        "id": 216,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku JavaScript metoda document.getElementById(id) ma za zadanie"
    },
    {
        "id": 217,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie217.jpg",
        "tresc": "Jakie wartości muszą przyjmować zmienne w funkcji biblioteki mysqli, aby połączyć się z serwerem i bazą danych?"
    },
    {
        "id": 218,
        "id_dzial": 1,
        "image": "",
        "tresc": "Testy dotyczące skalowalności oprogramowania mają za zadanie sprawdzić, czy aplikacja"
    },
    {
        "id": 219,
        "id_dzial": 1,
        "image": "",
        "tresc": "Debugger to program służący do"
    },
    {
        "id": 220,
        "id_dzial": 1,
        "image": "",
        "tresc": "Do grupowania obszarów na poziomie bloków, które będą formatowane za pośrednictwem znaczników, należy użyć"
    },
    {
        "id": 221,
        "id_dzial": 1,
        "image": "",
        "tresc": "Plikiem konfiguracyjnym, który pozwala na zdefiniowanie ustawień PHP dla całego serwera, jest"
    },
    {
        "id": 222,
        "id_dzial": 1,
        "image": "",
        "tresc": "Dana jest tabela ksiazki z polami: tytul, autor (typu tekstowego), cena (typu liczbowego). Aby kwerenda SELECT zwróciła tylko tytuły, dla których cena jest mniejsza od 50zł, należy zapisać:"
    },
    {
        "id": 223,
        "id_dzial": 1,
        "image": "",
        "tresc": "Zdefiniowano bazę danych z tabelą mieszkancy o polach: nazwisko, imie, miasto. Następnie stworzono następujące zapytanie do bazy: SELECT nazwisko, imie FROM mieszkancy WHERE miasto=\"Poznań\" UNION ALL SELECT nazwisko, imie FROM mieszkancy WHERE miasto=\"Kraków\"; Wskaż zapytanie, które zwróci identyczne dane:"
    },
    {
        "id": 224,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie224.jpg",
        "tresc": "Przedstawiona funkcja zapisana kodem JavaScript ma za zadanie:"
    },
    {
        "id": 225,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby ustawić tło na stronie www należy użyć polecenia"
    },
    {
        "id": 226,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie226.jpg",
        "tresc": "Który z przedstawionych kodów HTML sformatuje tekst według wzoru? (uwaga: słowo \"stacji\" jest zapisane większą czcionką niż reszta słów w tej linii)"
    },
    {
        "id": 227,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który z wymienionych systemów nie jest systemem CMS?"
    },
    {
        "id": 228,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie228.jpg",
        "tresc": "Przedstawiona baza danych zawiera trzy tabele i dwie relacje. Aby wyświetlić dane wszystkich lekarzy przypisanych do konkretnego pacjenta, należy przyrównać klucze"
    },
    {
        "id": 229,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wykonanie kodu JavaScript w przeglądarce wymaga"
    },
    {
        "id": 230,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie230.jpg",
        "tresc": "Przeglądarka internetowa wyświetliła stronę w następujący sposób. Wskaż kod HTML, który poprawnie definiuje przedstawioną hierarchiczną strukturę tekstu:"
    },
    {
        "id": 231,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku SQL, wykorzystywanym przez bazę danych MySQL w tabeli samochody, aby nadać wartość równą 0 dla kolumny przebieg, należy posłużyć się kwerendą"
    },
    {
        "id": 232,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie232.jpg",
        "tresc": "Fizyczny model replikacji bazy danych przedstawiony na rysunku jest modelem"
    },
    {
        "id": 233,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który znacznik służy budowaniu hierarchii tekstu w języku HTML?"
    },
    {
        "id": 234,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie234.jpg",
        "tresc": "Na rysunku została przedstawiona relacja jeden do wielu. Łączy ona"
    },
    {
        "id": 235,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który z elementów dokumentacji aplikacji powinien znaleźć się w dokumentacji użytkownika?"
    },
    {
        "id": 236,
        "id_dzial": 1,
        "image": "",
        "tresc": "W stylach CSS, aby ustalić styl linii obramowania jako linię kreskową, należy zastosować wartość"
    },
    {
        "id": 237,
        "id_dzial": 1,
        "image": "",
        "tresc": "W JavaScript wynik operacji jest równy wartości NaN, jeśli skrypt próbował wykonać"
    },
    {
        "id": 238,
        "id_dzial": 1,
        "image": "",
        "tresc": "Na potrzeby strony internetowej przygotowano grafikę rysunek.jpg o rozmiarze: szerokość 200 px, wysokość 100 px. Aby wyświetlić tę grafikę jako miniaturę – pomniejszoną z zachowaniem proporcji, można zastosować znacznik"
    },
    {
        "id": 239,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie239.jpg",
        "tresc": "Aby w języku HTML uzyskać takie formatowanie paragrafu dla tekstu należy zastosować kod"
    },
    {
        "id": 240,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który sposób komentowania jednoliniowego jest dozwolony w języku JavaScript?"
    },
    {
        "id": 241,
        "id_dzial": 1,
        "image": "",
        "tresc": "Które ze stwierdzeń prawidłowo charakteryzuje zdefiniowaną tabelę: CREATE TABLE dane (kolumna INTEGER(3));"
    },
    {
        "id": 242,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie242.jpg",
        "tresc": "Zakładając, że zmienna tablicowa $tab jest wypełniona liczbami naturalnymi, wynikiem programu będzie wypisanie"
    },
    {
        "id": 243,
        "id_dzial": 1,
        "image": "",
        "tresc": "Edytor spełniający założenia WYSIWYG musi umożliwiać"
    },
    {
        "id": 244,
        "id_dzial": 1,
        "image": "",
        "tresc": "Ikona, która wyświetlona jest przed adresem, w polu adresowym przeglądarki internetowej lub przy tytule otwartej karty przeglądarki nosi nazwę"
    },
    {
        "id": 245,
        "id_dzial": 1,
        "image": "",
        "tresc": "W celu zapewnienia spójności danych w bazie programu Microsoft Access należy skorzystać"
    },
    {
        "id": 246,
        "id_dzial": 1,
        "image": "",
        "tresc": "Interpreter PHP wygeneruje błąd i nie wykona kodu, jeżeli programista:"
    },
    {
        "id": 247,
        "id_dzial": 1,
        "image": "",
        "tresc": "Dołączenie zewnętrznego arkusza stylów do kodu HTML jest realizowane przy użyciu znacznika"
    },
    {
        "id": 248,
        "id_dzial": 1,
        "image": "",
        "tresc": "Rozmycie Gaussa, wygładzanie, szum RGB są funkcjami programu do obróbki"
    },
    {
        "id": 249,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie249.jpg",
        "tresc": "W języku JavaScript zapisano następującą funkcję. Ma ona za zadanie"
    },
    {
        "id": 250,
        "id_dzial": 1,
        "image": "",
        "tresc": "Do określenia listy definicji w kodzie HTML używa się znacznika"
    },
    {
        "id": 251,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie251.jpg",
        "tresc": "W języku HTML, aby uzyskać efekt jak na przykładzie, należy zastosować konstrukcję"
    },
    {
        "id": 252,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby stronę WWW można było przesłać do przeglądarki internetowej w postaci zaszyfrowanej, należy użyć protokołu"
    },
    {
        "id": 253,
        "id_dzial": 1,
        "image": "",
        "tresc": "Która z zasad tworzenia części <head> języka HTML jest poprawna?"
    },
    {
        "id": 254,
        "id_dzial": 1,
        "image": "",
        "tresc": "W bazie danych sklepu istnieje tabela artykuly zawierająca pole o nazwie nowy. Aby to pole wypełnić wartościami TRUE dla każdego rekordu, należy zastosować kwerendę"
    },
    {
        "id": 255,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby strona WWW była responsywna, należy między innymi definiować"
    },
    {
        "id": 256,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku CSS wartości: underline, overline, line-through oraz blink dotyczą właściwości"
    },
    {
        "id": 257,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby ustawić czcionkę Verdana w kodzie CSS, należy wykorzystać właściwość"
    },
    {
        "id": 258,
        "id_dzial": 1,
        "image": "",
        "tresc": "W procesie przygotowywania grafiki na stronę internetową należy wyciąć jedynie jej fragment. Taka operacja to"
    },
    {
        "id": 259,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wskaż FAŁSZYWE stwierdzenie dotyczące normalizacji sygnału dźwiękowego"
    },
    {
        "id": 260,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie260.jpg",
        "tresc": "Na tabeli muzyka, przedstawionej na rysunku, zostało wykonane następujące zapytanie SQL. Jaki wynik zwróci ta kwerenda?"
    },
    {
        "id": 261,
        "id_dzial": 1,
        "image": "",
        "tresc": "W celu przyspieszenia operacji na bazie danych należy do pól często wyszukiwanych lub sortowanych"
    },
    {
        "id": 262,
        "id_dzial": 1,
        "image": "",
        "tresc": "W bazie danych, w celu uporządkowania listy uczniów według roku urodzenia, należy użyć polecenia"
    },
    {
        "id": 263,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wykonując raport w systemie obsługi relacyjnych baz danych, umożliwia się"
    },
    {
        "id": 264,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby odebrać uprawnienia użytkownikowi, należy zastosować polecenie"
    },
    {
        "id": 265,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby utworzyć tabelę, należy się posłużyć poleceniem"
    },
    {
        "id": 266,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku JavaScript zdefiniowano obiekt Samochod. Aby wywołać jedną z metod tego obiektu, należy zapisać"
    },
    {
        "id": 267,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie267.jpg",
        "tresc": "Zamieszczony w ramce kod wyświetla tabelę składajacą się z"
    },
    {
        "id": 268,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby przenieść witrynę na serwer, można skorzystać z oprogramowania"
    },
    {
        "id": 269,
        "id_dzial": 1,
        "image": "",
        "tresc": "Integralność referencyjna w modelu relacyjnych baz danych oznacza, że"
    },
    {
        "id": 270,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku HTML znacznik <i> nadaje znakom taki sam wizualny efekt jak znacznik"
    },
    {
        "id": 271,
        "id_dzial": 1,
        "image": "",
        "tresc": "Do uruchomienia systemu CMS Joomla! wymagane jest środowisko:"
    },
    {
        "id": 272,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który z wymienionych formatów plików NIE JEST wykorzystywany do publikacji grafiki lub animacji na stronach internetowych?"
    },
    {
        "id": 273,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie273.jpg",
        "tresc": "W języku JavaScript zapisano definicję obiektu. Aby odwołać się do własności nazwisko należy zapisać"
    },
    {
        "id": 274,
        "id_dzial": 1,
        "image": "",
        "tresc": "Jak nazywa się proces przedstawienia, we właściwej dla danego środowiska formie, informacji zawartej w dokumencie elektronicznym?"
    },
    {
        "id": 275,
        "id_dzial": 1,
        "image": "",
        "tresc": "Jak nazywa się edytor wspomagający tworzenie stron internetowych, którego sposób działania można w polskim tłumaczeniu określić jako: otrzymujesz to, co widzisz?"
    },
    {
        "id": 276,
        "id_dzial": 1,
        "image": "",
        "tresc": "Które ze zdań opisuje grafikę wektorową?"
    },
    {
        "id": 277,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie277.jpg",
        "tresc": "W języku CSS poniższy zapis sprawi, że kolor żółty przyjmie czcionka"
    },
    {
        "id": 278,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie278.jpg",
        "tresc": "Zapisano kod HTML wstawiający grafikę na stronę internetową. Jeżeli rysunek.png nie zostanie odnaleziony, przeglądarka"
    },
    {
        "id": 279,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie279.jpg",
        "tresc": "Warunek zapisany językiem PHP wypisze liczbę, gdy"
    },
    {
        "id": 280,
        "id_dzial": 1,
        "image": "",
        "tresc": "Do uruchomienia skryptu JavaScript wymagane jest oprogramowanie"
    },
    {
        "id": 281,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie281.jpg",
        "tresc": "W prezentowanym kodzie PHP w miejscu kropek powinno znaleźć się polecenie"
    },
    {
        "id": 282,
        "id_dzial": 1,
        "image": "",
        "tresc": "Odwoływanie funkcji do samej siebie to"
    },
    {
        "id": 283,
        "id_dzial": 1,
        "image": "",
        "tresc": "Deklaracja w języku JavaScript: var x=true; powoduje, że zmienna x jest typu"
    },
    {
        "id": 284,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie284.jpg",
        "tresc": "Funkcja zapisana językiem PHP służy do"
    },
    {
        "id": 285,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie285.jpg",
        "tresc": "Podana definicja stylu CSS sprawi, że nagłówki pierwszego stopnia będą"
    },
    {
        "id": 286,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby stworzyć tabelę w bazie danych, należy zastosować polecenie SQL"
    },
    {
        "id": 287,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wskaż słowo kluczowe w języku C++ dodawane przed wbudowanym typem danych, które przesuwa zakres liczby wyłącznie nieujemne"
    },
    {
        "id": 288,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku SQL dla dowolnych zestawów danych w tabeli Uczniowie, aby wybrać rekordy, które zawierają wyłącznie uczennice o imieniu \"Aleksandra\", urodzone po roku \"1998\", należy zapisać zapytanie"
    },
    {
        "id": 289,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wymaganiem aplikacji internetowej jest, aby ta była wykonywana po stronie klienta. W którym języku należy zaimplementować tę aplikację?"
    },
    {
        "id": 290,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie290.jpg",
        "tresc": "W języku HTML zdefiniowano odnośnik do strony internetowej. Aby strona otwierała się w nowym oknie lub zakładce przeglądarki, należy dopisać do definicji odnośnika atrybut"
    },
    {
        "id": 291,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku PHP pobrano z bazy danych wyniki działania kwerendy za pomocą polecenia mysql_query(). Aby otrzymać ze zwróconej kwerendy wierszy danych, należy zastosować polecenie:"
    },
    {
        "id": 292,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku CSS, aby zdefiniować niestandardowe odstępy między wyrazami, stosuje się właściwość"
    },
    {
        "id": 293,
        "id_dzial": 1,
        "image": "",
        "tresc": "W kodzie HTML kolor biały można zapisać za pomocą wartości"
    },
    {
        "id": 294,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku CSS przypisano regułę: float:left; dla bloku. Reguła ta zostanie wykorzystana do"
    },
    {
        "id": 295,
        "id_dzial": 1,
        "image": "",
        "tresc": "Selektor CSS a:link {color:red} zawarty w kaskadowych arkuszach stylów definiuje"
    },
    {
        "id": 296,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie296.jpg",
        "tresc": "W języku JavaScript zapisano fragment kodu. Po wykonaniu skryptu zmienna x"
    },
    {
        "id": 297,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku JavaScript zdefiniowana zmienna i, która ma przechowywać wynik dzielenia wynoszący 1, to"
    },
    {
        "id": 298,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie298.jpg",
        "tresc": "Zamieszczony w ramce fragment kodu w JavaScript wypisze"
    },
    {
        "id": 299,
        "id_dzial": 1,
        "image": "",
        "tresc": "CMYK to zestaw czterech podstawowych kolorów farb drukarskich:"
    },
    {
        "id": 300,
        "id_dzial": 1,
        "image": "",
        "tresc": "Polecenie w języku SQL GRANT ALL PRIVILEGES ON klienci TO pracownik"
    },
    {
        "id": 301,
        "id_dzial": 1,
        "image": "",
        "tresc": "Zdefiniowano bazę danych z tabelą sklepy o polach: nazwa, ulica, miasto, branza. Aby wyszukać wszystkie nazwy sklepów spożywczych zlokalizowanych wyłącznie we Wrocławiu, należy posłużyć się kwerendą:"
    },
    {
        "id": 302,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku JavaScript instrukcję a++; można inaczej zapisać jako"
    },
    {
        "id": 303,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby uzyskać informacje o środowisku pracy serwera obsługującego PHP, należy skorzystać z funkcji"
    },
    {
        "id": 304,
        "id_dzial": 1,
        "image": "",
        "tresc": "Weryfikację kompletności formularza, działającą po stronie przeglądarki, należy zrealizować w języku"
    },
    {
        "id": 305,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie305.jpg",
        "tresc": "Dana jest tabela mieszkania zawierająca kolumny o nazwach: adres, metraz, ile_pokoi, standard, status, cena. Wykonanie przedstawionej kwerendy SQL SELECT sprawi, że zostaną wyświetlone"
    },
    {
        "id": 306,
        "id_dzial": 1,
        "image": "",
        "tresc": "W poleceniu CREATE TABLE języku SQL atrybut określający, która kolumna tabeli jest kluczem podstawowym, to"
    },
    {
        "id": 307,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie307.jpg",
        "tresc": "Wynikiem działania zamieszczonej pętli zapisanej językiem PHP jest wypisanie kolejnych liczb"
    },
    {
        "id": 308,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie308.jpg",
        "tresc": "Które wartości będą kolejno wypisane w wyniku działania przedstawionego skryptu"
    },
    {
        "id": 309,
        "id_dzial": 1,
        "image": "",
        "tresc": "Które polecenie SQL zamieni w tabeli tab w kolumnie kol wartość Ania na Zosia?"
    },
    {
        "id": 310,
        "id_dzial": 1,
        "image": "",
        "tresc": "W wyniku połączenia relacją kluczy głównych dwóch tabel otrzymuje się relację typu"
    },
    {
        "id": 311,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wartość pola tabeli pełniącego rolę klucza podstawowego"
    },
    {
        "id": 312,
        "id_dzial": 1,
        "image": "",
        "tresc": "Którą klauzulę powinno się zastosować w poleceniu CREATE TABLE języka SQL, aby dane pole rekordu nie było puste?"
    },
    {
        "id": 313,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie313.jpg",
        "tresc": "Przedstawiono fragment JavaScript. Po jego wykonaniu zmienna str2 będzie przechowywać"
    },
    {
        "id": 314,
        "id_dzial": 1,
        "image": "",
        "tresc": "Przy użyciu którego znacznika w języku HTML nie można umieścić na stronie grafiki dynamicznej?"
    },
    {
        "id": 315,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie315.jpg",
        "tresc": "Zapis znacznika HTML w postaci"
    },
    {
        "id": 316,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie316.jpg",
        "tresc": "Co spowoduje fragment skryptu w języku JavaScript?"
    },
    {
        "id": 317,
        "id_dzial": 1,
        "image": "",
        "tresc": "W procesie walidacji stron internetowych nie bada się"
    },
    {
        "id": 318,
        "id_dzial": 1,
        "image": "",
        "tresc": "Formatem zapisu rastrowych plików graficznych z kompresją bezstratną jest"
    },
    {
        "id": 319,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie319.jpg",
        "tresc": "W ramce przedstawiono kod JavaScript z błędem logicznym. Program powinien wypisywać informację, czy liczby są sobie równe czy nie, lecz nie wykonuje tego. Wskaż odpowiedź, która dotyczy błędu"
    },
    {
        "id": 320,
        "id_dzial": 1,
        "image": "",
        "tresc": "Chcąc zdefiniować formatowanie tabeli w języku CSS w taki sposób, aby wiersz, który jest aktualnie wskazywany kursorem myszy, został wyróżniony np. innym kolorem, należy zastosować"
    },
    {
        "id": 321,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie321.jpg",
        "tresc": "Logo systemu CMS o nazwie Joomla! to"
    },
    {
        "id": 322,
        "id_dzial": 1,
        "image": "",
        "tresc": "Formatem plików dźwiękowych z kompresją bezstratną jest"
    },
    {
        "id": 323,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie323.jpg",
        "tresc": "Programista napisał w języku C++ pętlę, która miała obliczyć wynik działania 5! (5! = 1 * 2 * 3 * 4 * 5). Popełnił jednak błąd logiczny polegający na tym, że"
    },
    {
        "id": 324,
        "id_dzial": 1,
        "image": "",
        "tresc": "W podanej regule CSS: h1 {color: blue} h1 oznacza"
    },
    {
        "id": 325,
        "id_dzial": 1,
        "image": "",
        "tresc": "Dla każdej iteracji pętli wartość bieżącego elementu tablicy jest przypisywana do zmiennej, a wskaźnik tablicy jest przesuwany o jeden, aż do ostatniego elementu tablicy. Zdanie to jest prawdziwe dla instrukcji"
    },
    {
        "id": 326,
        "id_dzial": 1,
        "image": "",
        "tresc": "Jak nazywa się technika umożliwiająca otwarcie połączenia klienta z serwerem i komunikację bez przeładowywania całej strony WWW w sposób asynchroniczny ?"
    },
    {
        "id": 327,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie327.jpg",
        "tresc": "Który kod jest alternatywny do kodu zamieszczonego w ramce?"
    },
    {
        "id": 328,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wskaż poprawną kolejność etapów projektowania relacyjnej bazy danych"
    },
    {
        "id": 329,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby w pliku z rozszerzeniem php umieścić kod w języku PHP należy użyć znaczników"
    },
    {
        "id": 330,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który opis odnosi się do metody POST wysyłania formularza?"
    },
    {
        "id": 331,
        "id_dzial": 1,
        "image": "",
        "tresc": "Tabela filmy zawiera klucz główny id oraz klucz obcy rezyserID. Tabela rezyserzy zawiera klucz główny id. Obydwie tabele połączone są relacją jeden po stronie rezyserzy do wielu po stronie filmy. Aby w kwerendzie SELECT połączyć tabele filmy i rezyserzy, należy zapisać"
    },
    {
        "id": 332,
        "id_dzial": 1,
        "image": "",
        "tresc": "Kolor zapisany w notacji heksadecymalnej #0000FF to"
    },
    {
        "id": 333,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby obraz umieszczony na stronie internetowej automatycznie skalował się do rozmiaru ekranu, na którym jest wyświetlana strona, należy"
    },
    {
        "id": 334,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku PHP zapisywanie danych do pliku realizuje funkcja"
    },
    {
        "id": 335,
        "id_dzial": 1,
        "image": "",
        "tresc": "Źródłem rekordów dla raportu może być"
    },
    {
        "id": 336,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie336.jpg",
        "tresc": "W wyniku działania pętli zapisanej w języku PHP zostanie wypisany ciąg liczb"
    },
    {
        "id": 337,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby policzyć wszystkie wiersze tabeli Koty należy użyć polecenia:"
    },
    {
        "id": 338,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku PHP, aby prawidłowo obsłużyć połączenie z bazą danych MySQL, ostatnią operacją, powinno być zastosowanie polecenia"
    },
    {
        "id": 339,
        "id_dzial": 1,
        "image": "",
        "tresc": "Proces filtracji sygnału wejściowego w dziedzinie czasu, obejmujący zasadę superpozycji, związany jest filtrem"
    },
    {
        "id": 340,
        "id_dzial": 1,
        "image": "",
        "tresc": "Zmienne typu int odnoszą się do liczb"
    },
    {
        "id": 341,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie341.jpg",
        "tresc": "W przedstawionym diagramie bazy danych biblioteka, elementy: czytelnik, wypozyczenie i ksiazka są"
    },
    {
        "id": 342,
        "id_dzial": 1,
        "image": "",
        "tresc": "Specjalna metoda danej klasy stosowana w programowaniu obiektowym, wywoływana automatycznie podczas tworzenia obiektu, której podstawowym zadaniem jest zwykle zainicjowanie pól, to"
    },
    {
        "id": 343,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby na stronie internetowej wyświetlić logo, którego tło jest przezroczyste, należy zastosować format"
    },
    {
        "id": 344,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie344.jpg",
        "tresc": "Którą z właściwości pola tabeli należy zdefiniować, aby pole przyjmowało dane składające się wyłącznie z cyfr?"
    },
    {
        "id": 345,
        "id_dzial": 1,
        "image": "",
        "tresc": "Która z reguł walidacji strony internetowej jest błędna?"
    },
    {
        "id": 346,
        "id_dzial": 1,
        "image": "",
        "tresc": "Formatem bezstratnej kompresji dźwięku jest"
    },
    {
        "id": 347,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie347.jpg",
        "tresc": "Które zapytanie SQL posłuży do wyszukania z przedstawionej tabeli wyłącznie wszystkich imion i nazwisk pacjentów urodzonych przed rokiem 2002?"
    },
    {
        "id": 348,
        "id_dzial": 1,
        "image": "",
        "tresc": "Która ze zdefiniowanych funkcji w języku PHP jako wynik zwraca połowę kwadratu wartości przekazanej?"
    },
    {
        "id": 349,
        "id_dzial": 1,
        "image": "",
        "tresc": "Za pomocą którego protokołu można opublikować stronę internetową na serwerze?"
    },
    {
        "id": 350,
        "id_dzial": 1,
        "image": "",
        "tresc": "Dana jest tabela pracownicy. Polecenie MySQL usuwające wszystkie rekordy z tabeli, dla których nie wypełniono pola rodzaj_umowy, ma postać"
    },
    {
        "id": 351,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku SQL wykorzystywanym przez bazę danych MySQL atrybut UNIQUE polecenia CREATE TABLE"
    },
    {
        "id": 352,
        "id_dzial": 1,
        "image": "",
        "tresc": "Podstawowym zadaniem systemu CMS jest oddzielenie treści serwisu informacyjnego od jego wyglądu. Efekt ten jest uzyskany poprzez generowanie zawartości"
    },
    {
        "id": 353,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie353.jpg",
        "tresc": "Odwołaniem do imienia Agata, zawartym w przedstawionej tablicy JavaScript, jest element"
    },
    {
        "id": 354,
        "id_dzial": 1,
        "image": "",
        "tresc": "Tekst paragrafu, wyśrodkowany w pionie, opisuje w CSS reguła"
    },
    {
        "id": 355,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku HTML zapis &lt; spowoduje wyświetlenie w przeglądarce znaku"
    },
    {
        "id": 356,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie356.jpg",
        "tresc": "Przedstawiony kod został zapisany w języku JavaScript. W podanej definicji obiektu metodą jest element o nazwie"
    },
    {
        "id": 357,
        "id_dzial": 1,
        "image": "",
        "tresc": "Które metody odnoszą się do predefiniowanego obiektu Date w języku JavaScript?"
    },
    {
        "id": 358,
        "id_dzial": 1,
        "image": "",
        "tresc": "Dana jest tabela programiści o polach: id, nick, ilosc_kodu, ocena. Pole ilosc_kodu zawiera liczbę linii kodu napisanych przez programistę w danym miesiącu. Aby policzyć sumę linii kodu, który napisali wszyscy programiści, należy użyć polecenia"
    },
    {
        "id": 359,
        "id_dzial": 1,
        "image": "",
        "tresc": "Tabela o nazwie naprawy zawiera pola: klient, czyNaprawione. Aby usunąć te rekordy, w których pole czyNaprawione jest prawdą, należy posłużyć się poleceniem"
    },
    {
        "id": 360,
        "id_dzial": 1,
        "image": "",
        "tresc": "W programie Microsoft Access formą zabezpieczeń dostępu do danych związaną z tabelą i kwerendą jest"
    },
    {
        "id": 361,
        "id_dzial": 1,
        "image": "",
        "tresc": "Klucz obcy w tabeli jest tworzony po to, aby"
    },
    {
        "id": 362,
        "id_dzial": 1,
        "image": "",
        "tresc": "Co to jest DBMS?"
    },
    {
        "id": 363,
        "id_dzial": 1,
        "image": "",
        "tresc": "W aplikacji internetowej komunikat powinien pojawiać się tylko wtedy, gdy dany użytkownik jest na stronie po raz pierwszy. Którą funkcję PHP należy w tym celu zastosować?"
    },
    {
        "id": 364,
        "id_dzial": 1,
        "image": "",
        "tresc": "Jak działa instrukcja łącząca wyniki zapytań INTERSECT w języku SQL?"
    },
    {
        "id": 365,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie365.jpg",
        "tresc": "Który z obrazów został sformatowany za pomocą przedstawionego stylu CSS?"
    },
    {
        "id": 366,
        "id_dzial": 1,
        "image": "",
        "tresc": "W tabeli podzespoly należy zmienić wartość pola URL na 'toshiba.pl' dla wszystkich rekordów, gdzie pole producent to TOSHIBA. W języku SQL modyfikacja będzie miała postać"
    },
    {
        "id": 367,
        "id_dzial": 1,
        "image": "",
        "tresc": "Ukrywanie pewnych pól lub metod obiektów danej klasy tak, aby były one dostępne tylko metodom wewnętrznym tej klasy lub funkcjom zaprzyjaźnionym, to"
    },
    {
        "id": 368,
        "id_dzial": 1,
        "image": "",
        "tresc": "Które polecenie w CSS służy do załączenia zewnętrznego arkusza stylów?"
    },
    {
        "id": 369,
        "id_dzial": 1,
        "image": "",
        "tresc": "W MS SQL Server polecenie RESTORE DATABASE służy do"
    },
    {
        "id": 370,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który zapis stylu CSS ustawi tło bloku na kolor niebieski?"
    },
    {
        "id": 371,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby przywrócić bazę danych z kopii bezpieczeństwa na serwerze MSSQL, należy posłużyć się poleceniem"
    },
    {
        "id": 372,
        "id_dzial": 1,
        "image": "",
        "tresc": "Co należy zastosować w organizacji danych, aby zapytania w bazie danych były wykonywane szybciej?"
    },
    {
        "id": 373,
        "id_dzial": 1,
        "image": "",
        "tresc": "Domyślna nazwa pliku konfiguracyjnego serwera Apache to"
    },
    {
        "id": 374,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku HTML, aby nadać dokumentowi tytuł \"Moja strona\", który będzie wyświetlany na zakładce przeglądarki internetowej, należy posłużyć się zapisem"
    },
    {
        "id": 375,
        "id_dzial": 1,
        "image": "",
        "tresc": "W instrukcji CREATE TABLE użycie klauzuli PRIMARY KEY przy deklaracji pola tabeli spowoduje, że pole to stanie się"
    },
    {
        "id": 376,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie376.jpg",
        "tresc": "Dla dowolnego a z przedziału (0,99) zadaniem funkcji zapisanej w języku Java Script jest:"
    },
    {
        "id": 377,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie377.jpg",
        "tresc": "W programie INKSCAPE / COREL aby uzyskać przedstawiony efekt napisu, należy"
    },
    {
        "id": 378,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku PHP, dla zmiennych a = 5 i b = 3 wartość typu zmiennoprzecinkowego zwróci wyrażenie"
    },
    {
        "id": 379,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku JavaScript, aby sprawdzić warunek czy liczba znajduje się w przedziale (100;200>, należy zapisać:"
    },
    {
        "id": 380,
        "id_dzial": 1,
        "image": "",
        "tresc": "Która z instrukcji umożliwia wysłanie tekstu do przeglądarki?"
    },
    {
        "id": 381,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie381.jpg",
        "tresc": "Przedstawione polecenie MySQL ma za zadanie"
    },
    {
        "id": 382,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie382.jpg",
        "tresc": "W języku JavaScript należy odwołać się do elementu zawartego w pierwszym paragrafie przedstawionego fragmentu strony HTML. Można to wykonać za pomocą funkcji"
    },
    {
        "id": 383,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie383.jpg",
        "tresc": "Na przedstawionej tabeli samochody wykonano zapytanie SQL: SELECT model FROM samochody WHERE rocznik=2016; W wyniku podanego zapytania zostaną zwrócone następujące wartości:"
    },
    {
        "id": 384,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie384.jpg",
        "tresc": "W języku CSS poniższy zapis sprawi, że koloru zielonego będzie"
    },
    {
        "id": 385,
        "id_dzial": 1,
        "image": "",
        "tresc": "Proces walidacji strony internetowej to"
    },
    {
        "id": 386,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który ze sposobów komentowania kodu nie jest stosowany w kodzie PHP?"
    },
    {
        "id": 387,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie387.jpg",
        "tresc": "Pętla zapisana w języku PHP wstawi do tablicy liczby"
    },
    {
        "id": 388,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie388.jpg",
        "tresc": "Stronę internetową zapisano w języku XHTML. Który z kodów stanowi implementację przedstawionego fragmentu strony, jeżeli żadne style CSS nie zostały zdefiniowane?"
    },
    {
        "id": 389,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby obraz zmieniał się płynnie w filmie, liczba klatek (nieprzenikających się wzajemnie) na sekundę musi znajdować się przynajmniej w zakresie"
    },
    {
        "id": 390,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie390.jpg",
        "tresc": "Według którego parametru oraz dla ilu tabel zostaną zwrócone wiersze na liście w wyniku przedstawionego zapytania?"
    },
    {
        "id": 391,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie391.jpg",
        "tresc": "Na obrazie przedstawiono efekt formatowania stylami CSS oraz kod HTML generujący ten przykład. Zakładając, że marginesy wewnętrzne wynoszą 50 px, a zewnętrzne wynoszą 20 px, styl CSS dla obrazu ma postać"
    },
    {
        "id": 392,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie392.jpg",
        "tresc": "W języku SQL wykonano przedstawione w ramce polecenia GRANT. Kto będzie miał prawo do przeglądania danych oraz ich zmiany?"
    },
    {
        "id": 393,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku JavaScript stworzono funkcję o nazwie liczba_max porównującą trzy liczby naturalne pobrane z parametrów funkcji i zwracającą maksymalną z nich. Prawidłowe wywołanie takiej funkcji wraz z pobraniem jej wyniku będzie miało postać"
    },
    {
        "id": 394,
        "id_dzial": 1,
        "image": "",
        "tresc": "Kwerenda pozwalająca na wprowadzenie zmian w wielu rekordach lub przeniesienie wielu rekordów przy użyciu pojedynczej operacji, nosi nazwę kwerendy"
    },
    {
        "id": 395,
        "id_dzial": 1,
        "image": "",
        "tresc": "Język JavaScrypt ma obsługę"
    },
    {
        "id": 396,
        "id_dzial": 1,
        "image": "",
        "tresc": "Program debugger służy do:"
    },
    {
        "id": 397,
        "id_dzial": 1,
        "image": "",
        "tresc": "Element zadeklarowany w języku C++ double *x; to"
    },
    {
        "id": 398,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby zbadać rozkład ilościowy poszczególnych kolorów zdjęcia, należy użyć"
    },
    {
        "id": 399,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie399.jpg",
        "tresc": "Przedstawione formatowanie CSS sprawi, że dla prezentowanego nagłówka trzeciego stopnia"
    },
    {
        "id": 400,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie400.jpg",
        "tresc": "Przedstawiony fragment kodu PHP ma za zadanie umieścić dane znajdujące się w zmiennych $a, $b, $c w bazie danych, w tabeli dane. Tabela dane zawiera cztery pola, z czego pierwsze to autoinkrementowany klucz główny. Które z poleceń powinno być przypisane do zmiennej $zapytanie?"
    },
    {
        "id": 401,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku HTML, aby dodać animację FLASH (z rozszerzeniem .swf) na stronę internetową, należy użyć znacznika"
    },
    {
        "id": 402,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby witryna internetowa prawidłowo skalowała się w urządzeniach mobilnych, należy wielkość czcionki zdefiniować"
    },
    {
        "id": 403,
        "id_dzial": 1,
        "image": "",
        "tresc": "Kolor zapisany w postaci szesnastkowej o wartości #11FE07 w kodzie RGB ma postać"
    },
    {
        "id": 404,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie404.jpg",
        "tresc": "Przedstawiony kod języka PHP"
    },
    {
        "id": 405,
        "id_dzial": 1,
        "image": "",
        "tresc": "Którego polecenia należy użyć, aby wyraz TEKST został wyświetlony w kolorze czarnym w oknie przeglądarki internetowej?"
    },
    {
        "id": 406,
        "id_dzial": 1,
        "image": "",
        "tresc": "Istnieje tabela pracownicy z polami: id, imie, nazwisko, pensja. W nowym roku postawiono podnieść pensję wszystkim pracownikom o 100 zł. Aktualizacja ta w bazie danych będzie miała postać"
    },
    {
        "id": 407,
        "id_dzial": 1,
        "image": "",
        "tresc": "Za pomocą języka PHP nie jest możliwe"
    },
    {
        "id": 408,
        "id_dzial": 1,
        "image": "",
        "tresc": "Personalizowanie wyglądu strony dla danego użytkownika i jego identyfikacja w serwisie są możliwe dzięki mechanizmowi"
    },
    {
        "id": 409,
        "id_dzial": 1,
        "image": "",
        "tresc": "Do reprezentacji liczb zmiennoprzecinkowych w języku C stosowany jest typ"
    },
    {
        "id": 410,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie410.jpg",
        "tresc": "W języku PHP chcąc wyświetlić ciąg n znaków @, należy użyć funkcji"
    },
    {
        "id": 411,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie411.jpg",
        "tresc": "Zamieszczony w ramce fragment skryptu w języku JavaScript"
    },
    {
        "id": 412,
        "id_dzial": 1,
        "image": "",
        "tresc": "W bazie danych sklepu komputerowego istnieje tabela komputery. Aby zdefiniować raport wyświetlający dla dowolnego zbioru danych tabeli, jedynie pola tabeli dla komputerów, w których jest nie mniej niż 8 GB pamięci, a procesor to Intel, można posłużyć sie kwerendą"
    },
    {
        "id": 413,
        "id_dzial": 1,
        "image": "",
        "tresc": "Do optymalnej realizacji algorytmu szukającego największej z trzech podanych liczb a, b i c, wystarczy zastosować"
    },
    {
        "id": 414,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie414.jpg",
        "tresc": "W ramce przedstawiono właściwości pliku graficznego. W celu optymalizacji czasu ładowania rysunku na stronę WWW należy"
    },
    {
        "id": 415,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który język skryptowy ogólnego przeznaczenia należy wykorzystać do tworzenia aplikacji WWW, zagnieżdżanych w języku HTML i uruchamianych po stronie serwera?"
    },
    {
        "id": 416,
        "id_dzial": 1,
        "image": "",
        "tresc": "Normalizacja tabel jest procesem, który ma na celu"
    },
    {
        "id": 417,
        "id_dzial": 1,
        "image": "",
        "tresc": "W programowaniu obiektowym mechanizm współdzielenia pól i metod klasy w taki sposób, że klasa pochodna zawiera metody zdefiniowane w klasie bazowej nazywa się"
    },
    {
        "id": 418,
        "id_dzial": 1,
        "image": "",
        "tresc": "Prawidłowy, zgodny ze standardem języka XHTML, zapis samozamykającego się znacznika odpowiadającego za łamanie linii ma postać"
    },
    {
        "id": 419,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który z formatów graficznych pozwala na zapis przejrzystego tła?"
    },
    {
        "id": 420,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie420.jpg",
        "tresc": "W tabeli pracownicy zdefiniowano klucz główny typu INTEGER z atrybutami NOT NULL oraz AUTO_INCREMENT. Ponadto zdefiniowano pola imie oraz nazwisko. W przypadku zastosowania przedstawionej kwerendy SQL wprowadzającej dane, w której zostało pominięte pole klucza, w bazie danych MySQL nastąpi"
    },
    {
        "id": 421,
        "id_dzial": 1,
        "image": "",
        "tresc": "W standardzie HDTV jest stosowana rozdzielczość"
    },
    {
        "id": 422,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie422.jpg",
        "tresc": "W języku PHP w wyniku działania fragmentu kodu w zmiennej o nazwie Nowy_Napis znajdzie się"
    },
    {
        "id": 423,
        "id_dzial": 1,
        "image": "",
        "tresc": "Operator arytmetyczny modulo w języku SQL to"
    },
    {
        "id": 424,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który z formatów NIE pozwala na zapis plików animowanych?"
    },
    {
        "id": 425,
        "id_dzial": 1,
        "image": "",
        "tresc": "Do zabezpieczeń serwera bazy danych przed atakami hakerów nie należy"
    },
    {
        "id": 426,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który z atrybutów background-attachment w języku CSS należy wybrać, aby tło strony było nieruchome względem okna przeglądarki?"
    },
    {
        "id": 427,
        "id_dzial": 1,
        "image": "",
        "tresc": "Którego ze słów kluczowych języka SQL należy użyć, aby wyeliminować duplikaty?"
    },
    {
        "id": 428,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie428.jpg",
        "tresc": "W programowaniu obiektowym w języku JavaScript użyty w przedstawionym kodzie zapis: this.zawod oznacza"
    },
    {
        "id": 429,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku PHP zmienna $_GET jest zmienną"
    },
    {
        "id": 430,
        "id_dzial": 1,
        "image": "",
        "tresc": "Które wyrażenie logiczne należy zastosować w języku JavaScript, aby wykonać operacje tylko dla dowolnych liczb ujemnych z przedziału jednostronnie domkniętego <-200,-100)?"
    },
    {
        "id": 431,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku HTML atrybut shape znacznika area, określający typ obszaru, może przyjąć wartość"
    },
    {
        "id": 432,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby poprawnie zdefiniować hierarchiczną strukturę tekstu witryny internetowej, należy zastosować"
    },
    {
        "id": 433,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby obraz wstawiony kodem HTML mógł być interpretowany przez programy wspomagające osoby niewidzące, należy zdefiniować atrybut"
    },
    {
        "id": 434,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie434.jpg",
        "tresc": "Przedstawiona definicja formularza została zastosowana na stronie internetowej, która wysyła dane do pliku zapisanego w języku PHP. W której tablicy będą dostępne dane z formularza?"
    },
    {
        "id": 435,
        "id_dzial": 1,
        "image": "",
        "tresc": "Konstruktor w języku PHP jest metodą o nazwie"
    },
    {
        "id": 436,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku JavaScript należy zapisać warunek, który będzie spełniony, gdy zmienna a będzie dowolną liczbą naturalną dodatnią (bez 0) lub gdy zmienna b będzie dowolną liczbą z przedziału domkniętego od 10 do 100. Użyte w tym warunku wyrażenie logiczne będzie miało postać"
    },
    {
        "id": 437,
        "id_dzial": 1,
        "image": "",
        "tresc": "Systemem zarządzania treścią pozwalającym na łatwe utworzenie i aktualizację serwisu WWW jest"
    },
    {
        "id": 438,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby zdefiniować krój czcionki w stylu CSS, należy użyć właściwości"
    },
    {
        "id": 439,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie439.jpg",
        "tresc": "Dana jest tabela uczniowie, do której wpisano rekordy jak na rysunku. Co będzie wynikiem działania przedstawionego zapytania SQL?"
    },
    {
        "id": 440,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie440.jpg",
        "tresc": "W edytorze grafiki wektorowej stworzono przedstawiony kształt, który powstał z dwóch figur: trójkąta i koła. W celu stworzenia tego kształtu, po narysowaniu figur i odpowiednim ich ustawieniu, należy skorzystać z funkcji"
    },
    {
        "id": 441,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który z wymienionych znaczników należy do części <head> dokumentu HTML?"
    },
    {
        "id": 442,
        "id_dzial": 1,
        "image": "",
        "tresc": "Które stwierdzenie odnosi się do skalowania obrazu?"
    },
    {
        "id": 443,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie443.jpg",
        "tresc": "Fragment kodu w języku JavaScript realizujący dodawanie dwóch liczb ma następującą postać. Aby dodawanie wykonane było po kliknięciu przycisku o nazwie dodaj, należy w wykropkowane miejsce wstawić"
    },
    {
        "id": 444,
        "id_dzial": 1,
        "image": "",
        "tresc": "Tworząc tabelę w języku SQL, zdefiniowano dla kolumny klucz główny. Aby zabezpieczyć ją przed wstawieniem wartości pustej, należy zastosować atrybut"
    },
    {
        "id": 445,
        "id_dzial": 1,
        "image": "",
        "tresc": "Baza danych zawiera tabele artykuły z polami: nazwa, typ, producent, cena. Aby wyświetlić wszystkie nazwy artykułów wyłącznie typu pralka, dla których cena jest z przedziału 1000 PLN i 1500 PLN, należy zastosować polecenie"
    },
    {
        "id": 446,
        "id_dzial": 1,
        "image": "",
        "tresc": "Funkcja agregująca MIN języka SQL ma za zadanie policzyć"
    },
    {
        "id": 447,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku CSS, aby formatować tekst poprzez przekreślenie, podkreślenie dolne lub górne, należy zastosować"
    },
    {
        "id": 448,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie448.jpg",
        "tresc": "Ile razy zostanie wykonana pętla zapisana w przedstawionym skrypcie PHP?"
    },
    {
        "id": 449,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie449.jpg",
        "tresc": "W języku PHP zapisano fragment kodu. Plik cookie stworzony tym poleceniem"
    },
    {
        "id": 450,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku HTML, aby uzyskać następujący efekt pogrubienia, pochylenia lub zapisania w górnym indeksie należy zapisać kod:"
    },
    {
        "id": 451,
        "id_dzial": 1,
        "image": "",
        "tresc": "Witryna internetowa wysyła dane poufne za pomocą formularza do kodu PHP. Która metoda wysłania jest najbardziej bezpieczna?"
    },
    {
        "id": 452,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby pozbyć się nienaturalnego odwzorowania ukośnych krawędzi linii w grafice rastrowej, czyli tak zwanego schodkowania, należy zastosować filtr"
    },
    {
        "id": 453,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie453.jpg",
        "tresc": "W języku JavaScript zapisano kod, którego wynikiem działania jest"
    },
    {
        "id": 454,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie454.jpg",
        "tresc": "W języku JavaScript zapis w ramce oznacza, że"
    },
    {
        "id": 455,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie455.jpg",
        "tresc": "W języku PHP zapisano fragment kodu działającego na bazie MySQL. Jego zadaniem jest wypisanie"
    },
    {
        "id": 456,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie456.jpg",
        "tresc": "W języku CSS zdefiniowano formatowanie paragrafu, które przypisze mu następujące cechy:"
    },
    {
        "id": 457,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie457.jpg",
        "tresc": "Fragment kodu języku PHP ma następującą postać. Wynikiem działania pętli będzie wypisanie liczb:"
    },
    {
        "id": 458,
        "id_dzial": 1,
        "image": "",
        "tresc": "Polecenie DBCC CHECKDB(\"sklepAGD\", Repair_fast) w MS SQL Server"
    },
    {
        "id": 459,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie459.jpg",
        "tresc": "Jak posortowana będzie lista, utworzona ze wszystkich kolumn tabeli uczniowie i zawierająca uczniów ze średnią większą od 5, która zostanie zwrócona jako wynik przedstawionego zapytania?"
    },
    {
        "id": 460,
        "id_dzial": 1,
        "image": "",
        "tresc": "Funkcja phpinfo() pozwala na:"
    },
    {
        "id": 461,
        "id_dzial": 1,
        "image": "",
        "tresc": "Która z wymienionych funkcji sortowania wykorzystywana w języku PHP sortuje tablicę asocjacyjną według indeksów"
    },
    {
        "id": 462,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie462.jpg",
        "tresc": "Zakładając, że zmienne: a, b, c przechowują wartości numeryczne, wynikiem działania warunku będzie wypisanie liczby"
    },
    {
        "id": 463,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie463.jpg",
        "tresc": "Atrybut value w polu formularza XHTML"
    },
    {
        "id": 464,
        "id_dzial": 1,
        "image": "",
        "tresc": "Zapytanie z klauzulą JOIN stosuje się, aby"
    },
    {
        "id": 465,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie465.jpg",
        "tresc": "W języku HTML zdefiniowano znacznik a. Wartość nofollow atrybutu rel"
    },
    {
        "id": 466,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku SQL, aby stworzyć tabelę, należy zastosować polecenie"
    },
    {
        "id": 467,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku JavaScript, aby zmienić wartość atrybutu znacznika HTML, po uzyskaniu obiektu za pomocą metody getElementById należy skorzystać z"
    },
    {
        "id": 468,
        "id_dzial": 1,
        "image": "",
        "tresc": "Który z wymienionych znaczników języka HTML nie jest stosowany w celu formatowania tekstu?"
    },
    {
        "id": 469,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku JavaScript wynik działania instrukcji zmienna++; będzie taki sam jak instrukcji"
    },
    {
        "id": 470,
        "id_dzial": 1,
        "image": "",
        "tresc": "Program FileZilla może posłużyć do"
    },
    {
        "id": 471,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie471.jpg",
        "tresc": "Podane polecenie SQL ma za zadanie"
    },
    {
        "id": 472,
        "id_dzial": 1,
        "image": "",
        "tresc": "Platforma wspierająca programowanie w technologii .NET to"
    },
    {
        "id": 473,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie473.jpg",
        "tresc": "Tabele Osoby i Adresy są połączone relacją jeden do wielu. Jakie zapytanie SQL należy zapisać, aby korzystając z tej relacji, prawidłowo wyświetlić nazwiska oraz przyporządkowane im miasta?"
    },
    {
        "id": 474,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby podczas tworzenia tabeli utworzyć klucz obcy na wielu kolumnach, należy użyć polecenia"
    },
    {
        "id": 475,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie475.jpg",
        "tresc": "Który z rysunków obrazuje efekt działania przedstawionego fragmentu kodu HTML?"
    },
    {
        "id": 476,
        "id_dzial": 1,
        "image": "",
        "tresc": "Tabela Pacjenci ma pola: imie, nazwisko, wiek, lekarz_id. Aby zestawić raport zawierający wyłącznie imiona i nazwiska pacjentów poniżej 18 roku życia, którzy zapisani są do lekarza o id równym 6, można posłużyć się kwerendą SQL"
    },
    {
        "id": 477,
        "id_dzial": 1,
        "image": "",
        "tresc": "Prosta animacja może być zapisana w formacie"
    },
    {
        "id": 478,
        "id_dzial": 1,
        "image": "",
        "tresc": "Którego znacznika NIE NALEŻY umieszczać w nagłówku dokumentu HTML?"
    },
    {
        "id": 479,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby usunąć tabelę należy zastosować kwerendę"
    },
    {
        "id": 480,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie480.jpg",
        "tresc": "Który z przedstawionych kodów XHTML sformatuje tekst według podanego wzoru?"
    },
    {
        "id": 481,
        "id_dzial": 1,
        "image": "",
        "tresc": "Dana jest tabela o nazwie przedmioty z polami: ocena i uczenID. Aby policzyć średnią ocen ucznia o ID równym 7, należy posłużyć się zapytaniem"
    },
    {
        "id": 482,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie482.jpg",
        "tresc": "Efektem wykonania przedstawionego kodu PHP jest wyświetlenie komunikatu"
    },
    {
        "id": 483,
        "id_dzial": 1,
        "image": "",
        "tresc": "Cechą formatu PNG jest"
    },
    {
        "id": 484,
        "id_dzial": 1,
        "image": "",
        "tresc": "W MS SQL Server predefiniowana rola o nazwie dbcreator pozwala użytkownikowi na"
    },
    {
        "id": 485,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby zamieścić aplikację PHP w internecie, należy jej pliki źródłowe skopiować na serwer za pomocą protokołu"
    },
    {
        "id": 486,
        "id_dzial": 1,
        "image": "",
        "tresc": "Wskaż poprawną zasadę dotyczącą spójności danych w bazie danych"
    },
    {
        "id": 487,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku SQL, aby wstawić wiersz danych do bazy, należy zastosować polecenie"
    },
    {
        "id": 488,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie488.jpg",
        "tresc": "W formularzu, dane z pola input o typie number zostały zapisane do zmiennej a, a następnie przetworzone w skrypcie JavaScript w następujący sposób. Zmienna x będzie typu"
    },
    {
        "id": 489,
        "id_dzial": 1,
        "image": "",
        "tresc": "Język HTML dysponuje nagłówkami do budowania hierarchii treści. Nagłówki te występują jedynie w zakresie"
    },
    {
        "id": 490,
        "id_dzial": 1,
        "image": "",
        "tresc": "W której technologii nie jest możliwe przetwarzanie danych użytkownika wprowadzanych na stronie WWW?"
    },
    {
        "id": 491,
        "id_dzial": 1,
        "image": "images_dzial1/pytanie491.jpg",
        "tresc": "W jakim formacie będzie wyświetlana data po uruchomieniu przedstawionego kodu?"
    },
    {
        "id": 492,
        "id_dzial": 1,
        "image": "",
        "tresc": "Kolor zapisany kodem RGB o wartości rgb(128, 16, 8) w postaci szesnastkowej ma wartość"
    },
    {
        "id": 493,
        "id_dzial": 1,
        "image": "",
        "tresc": "Aby naprawić bazę danych w MySQL, należy użyć polecenia"
    },
    {
        "id": 494,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku JavaScript typ boolean może być reprezentowany przez wartość"
    },
    {
        "id": 495,
        "id_dzial": 1,
        "image": "",
        "tresc": "W języku HTML informacje dotyczące autora, streszczenia i słów kluczowych strony należy umieścić"
    },
    {
        "id": 496,
        "id_dzial": 1,
        "image": "",
        "tresc": "Barwa zapisana w modelu RGB(255, 0, 0) jest"
    }
]